makerbase-mks/MKS-TFT28-32-Firmware/Utilities/STM32_EVAL/STM3210C_EVAL/stm3210c_lcd_9341.c
/**
  ******************************************************************************
  * @file    stm3210c_eval_lcd.c
  * @author  MCD Application Team
  * @version V4.2.0
  * @date    04/16/2010
  * @brief   This file includes the LCD driver for AM-240320L8TNQW00H (LCD_ILI9320)
  *          Liquid Crystal Display Module of STM3210C-EVAL board.
  * @updata  www.armjishu.com Team
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 STMicroelectronics</center></h2>
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm3210c_eval_lcd.h"
//#include "../Common/fonts.c"
#include "xprintf.h"
/******************** (C) COPYRIGHT 2013 www.armjishu.com  ********************
 * 文件名  ：SZ_STM32F107VC_LCD.c
 * 描述    ：提供STM32F107VC神舟IV号开发板的TFT_LCD彩屏相关库函数
 * 实验平台：STM32神舟开发板
 * 作者    ：www.armjishu.com 
*******************************************************************************/



/**-------------------------------------------------------
  * LCD默认采用横屏显示，其中坐标表示为(x,y)
  * x LCD的行数  
  * y LCD的列数
  (0,0)     表示LCD左上角的点 
  (239,319) 表示LCD右下角的点   
  (0,2)     表示LCD第1行第3列的点行
  (238,2)   表示LCD第239行第3列的点行
          yyyy                               Y
          0123                               319             
  X = 0   |--(0,2)-------- ~~~ --------------|
  X = 1   |--------------- ~~~ --------------|
  X = 2   |--------------- ~~~ --------------|
  .....
  X = 237 |--------------- ~~~ --------------|
  X = 238 |--(238,2)------ ~~~ --------------|  
  X = 239 |--------------- ~~~ --------------|(239,319)
  
***------------------------------------------------------*/



//#define LCD_DEBUG_PRINTF               printf
#define LCD_DEBUG_PRINTF(str,args...)    ((void)0)


#define SetCs  GPIO_SetBits(LCD_PORT_CS, LCD_Pin_CS);
#define ClrCs  GPIO_ResetBits(LCD_PORT_CS, LCD_Pin_CS);
 

#define SetWr  GPIO_SetBits(LCD_PORT_WR, LCD_Pin_WR);
#define ClrWr  GPIO_ResetBits(LCD_PORT_WR, LCD_Pin_WR);

#define SetRs  GPIO_SetBits(LCD_PORT_RS, LCD_Pin_RS);
#define ClrRs  GPIO_ResetBits(LCD_PORT_RS, LCD_Pin_RS);

#define SetRd  GPIO_SetBits(LCD_PORT_RD, LCD_Pin_RD);
#define ClrRd  GPIO_ResetBits(LCD_PORT_RD, LCD_Pin_RD);

#define LCD_Write(LCD_DATA)  GPIO_Write(GPIOE, LCD_DATA)
#define LCD_Read()  GPIO_ReadInputData(GPIOE)


/* Delay函数在"SZ_STM32F107VC_LIB.h"有定义 */
#define Delay(nCount)  Delay(12000 * nCount) 

/* 前景色TextColor和背景色BackColor */
static  __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;
/* LCD模组驱动芯片ID */
static  __IO uint16_t DeviceIdCode;
/* LCD当前的英文字库 */
sFONT *LCD_Currentfonts;

static __IO uint8_t HyalineBack = HyalineBackDis;
/** @defgroup STM3210C_EVAL_LCD_Private_Defines
  * @{
  */ 

#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))

#define ABS(X)  ((X) > 0 ? (X) : -(X))    

#define Delay(nCount)  lcd_delay(12000 * nCount) 

static void lcd_delay(__IO uint32_t nCount)
{
    for (; nCount != 0; nCount--);
}

//写寄存器函数FOR 9341
void LCD_WR_REG(u8 data)
{ 
        ClrRs	//写地址  
        ClrCs         
        SetRd
        ClrWr

        LCD_Write(data);       
        SetWr
        SetRs
        SetCs  
}

//写数据函数FOR 9341
void LCD_WR_DATA(u8 data)
{ 
        SetRs	//写地址  
        ClrCs         
        SetRd
        ClrWr

        LCD_Write(data);       
        SetWr
        SetRs
        SetCs  
}


/*******************************************************************************
* Function Name  : LCD_DB_AS_InPut
* Description    : config MCU LCD_DB pins AS InPut
* Input          : None
* Output         : None
* Return         : None.
*******************************************************************************/
void LCD_DB_AS_InPut(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  // DB15--0
  GPIO_InitStructure.GPIO_Pin = LCD_PIN_DATA;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(LCD_PORT_DAT, &GPIO_InitStructure);
}

/*******************************************************************************
* Function Name  : LCD_DB_AS_OutPut
* Description    : config MCU LCD_DB pins AS OutPut
* Input          : None
* Output         : None
* Return         : None.
*******************************************************************************/
void LCD_DB_AS_OutPut(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  // DB15--0
  GPIO_InitStructure.GPIO_Pin = LCD_PIN_DATA;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(LCD_PORT_DAT, &GPIO_InitStructure);
}

/****************************************************************************
* 名    称：void LCD_Setup()
* 功    能：初始化 LCD 控制器
* 入口参数：无
* 出口参数：无
* 说    明：
* 调用方法：LCD_Setup();
* 作    者： www.armjishu.com TEAM
****************************************************************************/
void LCD_Setup(void)
{ 
    const uint8_t LogoStr[] = "  www.armjishu.com  ";
    uint8_t Devicestr[] = " LCD Driver ID:9320 ";

    /* Configure the LCD pins config --------------------------------------------*/
    LCD_Pins_Config();

    Delay(1); /* Delay 50 ms */
    LCD_WriteReg(0x0000,0x0001);          //start internal osc
    Delay(3); /* Delay 50 ms */
    LCD_DB_AS_InPut();
    Delay(2); /* Delay 50 ms */
    DeviceIdCode = LCD_ReadReg(0x0004);
    DeviceIdCode = LCD_ReadReg(0x0004);
    //LCD_DEBUG_PRINTF("\n\r ###### www.armjishu.com DeviceIdCode = 0x%x ###### ", DeviceIdCode);

    Devicestr[15] = ((DeviceIdCode >> 12) & 0xF) + 0x30;
    Devicestr[16] = ((DeviceIdCode >> 8) & 0xF) + 0x30;
    Devicestr[17] = ((DeviceIdCode >> 4) & 0xF) + 0x30;
    Devicestr[18] = ((DeviceIdCode >> 0) & 0xF) + 0x30;

