makerbase-mks/MKS-TFT28-32-Firmware/Utilities/STM32_EVAL/STM3210C_EVAL/stm3210c_lcd_9341.c
        LCD_WR_REG(0xC0);
                        LCD_WR_DATA(0x22);

        LCD_WR_REG(0xC1);
                        LCD_WR_DATA(0x12);

        LCD_WR_REG(0xC5);
                        LCD_WR_DATA(0x5C);
                        LCD_WR_DATA(0x4C);

        LCD_WR_REG(0xC7);
                        LCD_WR_DATA(0x8F);

        LCD_WR_REG(0x36);
                      //  LCD_WR_DATA(0xe8);//use this to use ucgui
                        LCD_WR_DATA(0xc8);
                     //   LCD_WR_DATA(0x68);

        LCD_WR_REG(0x3A);
                        LCD_WR_DATA(0x55);

        LCD_WR_REG(0xF2);
                        LCD_WR_DATA(0x02);

        LCD_WR_REG(0x26);
                        LCD_WR_DATA(0x01);

        LCD_WR_REG(0xE0);
                        LCD_WR_DATA(0x0F);
                        LCD_WR_DATA(0x20);
                        LCD_WR_DATA(0x19);
                        LCD_WR_DATA(0x0F);
                        LCD_WR_DATA(0x10);
                        LCD_WR_DATA(0x08);
                        LCD_WR_DATA(0x4A);
                        LCD_WR_DATA(0xF6);
                        LCD_WR_DATA(0x3A);
                        LCD_WR_DATA(0x0F);
                        LCD_WR_DATA(0x14);
                        LCD_WR_DATA(0x09);
                        LCD_WR_DATA(0x18);
                        LCD_WR_DATA(0x0B);
                        LCD_WR_DATA(0x08);
        LCD_WR_REG(0xE1);
                        LCD_WR_DATA(0x00);
                        LCD_WR_DATA(0x1E);
                        LCD_WR_DATA(0x1E);
                        LCD_WR_DATA(0x05);
                        LCD_WR_DATA(0x0F);
                        LCD_WR_DATA(0x04);
                        LCD_WR_DATA(0x31);
                        LCD_WR_DATA(0x33);
                        LCD_WR_DATA(0x43);
                        LCD_WR_DATA(0x04);
                        LCD_WR_DATA(0x0B);
                        LCD_WR_DATA(0x06);
                        LCD_WR_DATA(0x27);
                        LCD_WR_DATA(0x34);
                        LCD_WR_DATA(0x0F);

        LCD_WR_REG(0x11);
        
        lcd_delay(120);

        LCD_WR_REG(0x29);

        LCD_WR_REG(0x2A);
                        LCD_WR_DATA(0x00);
                        LCD_WR_DATA(0x00);
                       // LCD_WR_DATA(0x00);
                       // LCD_WR_DATA(0xEF);
                        LCD_WR_DATA(0x01);
                        LCD_WR_DATA(0x3F);
        LCD_WR_REG(0x2B);
                        LCD_WR_DATA(0x00);
                        LCD_WR_DATA(0x00);
                      //  LCD_WR_DATA(0x01);
                        LCD_WR_DATA(0x00);
                        LCD_WR_DATA(0xEF);
        LCD_WR_REG(0x2C);
		
		
      //  //LCD_DEBUG_PRINTF("\n\r ###### Err: Unknow DeviceIdCode 0x%x ###### ", DeviceIdCode);
    }

 //   LCD_Clear(LCD_COLOR_GREEN);

    /* 设置LCD的前景色和背景色 */
//    LCD_SetTextColor(LCD_COLOR_YELLOW);
 //   LCD_SetBackColor(LCD_COLOR_RED);

    /* 设置默认字体 Setups the default font */
  //  LCD_SetFont(&Font16x24);    
   // LCD_DisplayStringLine(LCD_LINE_5, (uint8_t *)LogoStr);
   // LCD_DisplayStringLine(LCD_LINE_6, (uint8_t *)Devicestr);
   // LCD_DisplayWelcomeStr(LCD_LINE_3);
    
    /* LCD显示一个灰度二值图片，理解这个函数是理解中英文显示的基础 */
   /* LCD_Image2LcdDrawMonoBinaryPic(2, 2, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(2, 66, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(2, 130, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(2, 194, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(2, 258, (const uint8_t *)gImage_ST_ICON);
    
    LCD_Image2LcdDrawMonoBinaryPic(206, 2, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(206, 66, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(206, 130, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(206, 194, (const uint8_t *)gImage_ST_ICON);
    LCD_Image2LcdDrawMonoBinaryPic(206, 258, (const uint8_t *)gImage_ST_ICON);*/
        
    //Delay(1000);
}


/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void SZ_STM32_LCDInit(void)
{
    /* Setups the LCD */
    LCD_Setup();

    /* 设置默认字体 Setups the default font */
  //  LCD_SetFont(&LCD_DEFAULT_FONT);
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
    TextColor = _TextColor; 
    BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text 
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background 
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
    *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
    TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
    BackColor = Color;
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{
    uint32_t index = 0;

    LCD_SetCursor(0,0); 
    LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

    // 视频加速 www.armjishu.com
    ClrCs
    SetRs
    LCD_Write(Color);
    for(index=0; index<(LCD_PIXEL_WIDTH * LCD_PIXEL_HEIGHT); index++)
    {
        ClrWr
        //LCD_Write(Color);
        SetWr
    }
    SetCs
}


/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
    if(DeviceIdCode==0x8989)
    {
        LCD_WriteReg(0x004e,Xpos);      //行
        LCD_WriteReg(0x004f,Ypos);      //列
    }
    else if((DeviceIdCode==0x9320))
    {
        LCD_WriteReg(0x0020,Xpos);      // 行
        LCD_WriteReg(0x0021,0x13f-Ypos);// 列
    }
    else if((DeviceIdCode==0x9919))
    {
        LCD_WriteReg(0x004e,Xpos);      // 行
        LCD_WriteReg(0x004f,Ypos);      // 列    
    }
    else
    {
        LCD_WR_REG(0X2A); 
        LCD_WR_DATA(Xpos>>8); 
        LCD_WR_DATA(Xpos&0XFF);         
        LCD_WR_REG(0X2B); 
        LCD_WR_DATA(Ypos>>8); 
        LCD_WR_DATA(Ypos&0XFF);
    }
}

/**
  * @brief  Displays a Point.
  * @param  Color: specifies the Color.
  * @retval None
  */
void LCD_SetPoint(uint16_t Xpos, uint16_t Ypos, uint16_t Color)
{ 
    LCD_SetCursor(Xpos, Ypos);
    LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
    LCD_WriteRAM(Color);
    SetCs
}

/**
  * @brief  Displays a pixel.
  * @param  x: pixel x.
  * @param  y: pixel y.  
  * @retval None
  */
void PutPixel(int16_t Xpos, int16_t Ypos)
{ 
    if(Xpos < 0 || Xpos > LCD_PIXEL_HEIGHT || Ypos < 0 || Ypos > LCD_PIXEL_WIDTH)
    {
        return;  
    }
    LCD_SetPoint(Xpos, Ypos, TextColor);
}

/**
  * @brief  Displays a Point.
  * @param  Color: specifies the Color.
  * @retval None
  */
uint16_t LCD_GetPoint(uint16_t Xpos, uint16_t Ypos)
{ 
    uint16_t Color;
    LCD_SetCursor(Xpos, Ypos);

