makerbase-mks/MKS-TFT28-32-Firmware/Utilities/STM32_EVAL/STM3210C_EVAL/stm3210c_lcd_9341.c
    /* Write 16-bit Index (then Read Reg) */
    ClrCs
    ClrRs
    ClrWr
    LCD_Write(LCD_Reg);
    SetWr

    LCD_DB_AS_InPut();

    /* Read 16-bit Reg */
    SetRs
    ClrRd
    SetRd
    data = LCD_Read(); 
    SetCs
    LCD_DB_AS_OutPut();

    return    data;
}


/**
  * @brief  Prepare to write to the LCD RAM.
  * @param  None
  * @retval None
  */
void LCD_WriteRAM_Prepare(void)
{
    /* Write 16-bit Index, then Write Reg */
    ClrCs
    ClrRs
    ClrWr
    LCD_Write(0x2c);
    SetWr
    SetRs
}


/**
  * @brief  Writes 1 word to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LCD_WriteRAMWord(uint16_t RGB_Code)
{
    LCD_WriteRAM_Prepare();
    LCD_WriteRAM(RGB_Code);
    SetCs
}


/**
  * @brief  Writes to the selected LCD register.
  * @param  LCD_Reg: address of the selected register.
  * @param  LCD_RegValue: value to write to the selected register.
  * @retval None
  */
void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue)
{

     LCD_WR_REG(LCD_Reg);  
     LCD_WR_DATA(LCD_RegValue);  
}


/**
  * @brief  Writes to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LCD_WriteRAM(uint16_t RGB_Code)
{
    ClrWr
    LCD_Write(RGB_Code);
    SetWr
}


/**
  * @brief  Power on the LCD.
  * @param  None
  * @retval None
  */
void LCD_PowerOn(void)
{ 
	LCD_WR_REG(0X29); //26万色显示开启
}

//LCD关闭显示        ILI9341
void LCD_DisplayOff(void)
{           
        LCD_WR_REG(0X28);//关闭显示 
}  

/*******************************************************************************
* Function Name  : LCD_Pins_Config
* Description    : Configures LCD Pins
                   Push-Pull mode.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void LCD_Pins_Config(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_APB2PeriphClockCmd(LCD_CLK_RS  | LCD_CLK_DATA |
                            LCD_CLK_WR | LCD_CLK_RD   |
                            LCD_CLK_CS, ENABLE);

    // DB15--0
    GPIO_InitStructure.GPIO_Pin = LCD_PIN_DATA;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(LCD_PORT_DAT, &GPIO_InitStructure);

    //LCD_Pin_WR
    GPIO_InitStructure.GPIO_Pin = LCD_Pin_WR;
    GPIO_Init(LCD_PORT_WR, &GPIO_InitStructure);

    //LCD_Pin_CS
    GPIO_InitStructure.GPIO_Pin = LCD_Pin_CS;
    GPIO_Init(LCD_PORT_CS, &GPIO_InitStructure);

    //LCD_Pin_RS
    GPIO_InitStructure.GPIO_Pin = LCD_Pin_RS;
    GPIO_Init(LCD_PORT_RS, &GPIO_InitStructure);

    //LCD_Pin_RD
    GPIO_InitStructure.GPIO_Pin = LCD_Pin_RD;
    GPIO_Init(LCD_PORT_RD, &GPIO_InitStructure);

    SetCs
    SetWr
    SetRd
    SetRs
}

/* ST的LOGO灰度二值图片数据库 */
/*const unsigned char gImage_ST_ICON[262] = { 0X00,0X01,0X3B,0X00,0X20,0X00,
0X00,0X03,0XFF,0XFF,0XFF,0XFF,0XFF,0XE0,0X00,0X03,0XFF,0XFF,0XFF,0XFF,0XFF,0XC0,
0X00,0X07,0XFF,0XFF,0XFF,0XFF,0XFF,0XC0,0X00,0X07,0XFF,0XFF,0XFF,0XFF,0XFF,0X80,
0X00,0X0F,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X0E,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X1C,0X00,0X00,0X00,0X00,0X00,0X00,0X00,0X18,0X00,0X00,0X00,0X00,0X00,0X00,
0X00,0X30,0X1F,0XFF,0XFF,0X03,0XFE,0X00,0X00,0X30,0X3F,0XFF,0XFF,0X03,0XFE,0X00,
0X00,0X70,0X3F,0XFF,0XFE,0X07,0XFC,0X00,0X00,0X70,0X3F,0XFF,0XFE,0X07,0XFC,0X00,
0X00,0XF8,0X1F,0XFF,0XFC,0X0F,0XF8,0X00,0X00,0XF8,0X0F,0XFF,0XFC,0X0F,0XF8,0X00,
0X01,0XFC,0X07,0XFF,0XF8,0X1F,0XF0,0X00,0X01,0XFE,0X03,0XFF,0XF8,0X1F,0XF0,0X00,
0X03,0XFF,0X01,0XFF,0XF0,0X3F,0XE0,0X00,0X03,0XFF,0X80,0XFF,0XF0,0X3F,0XE0,0X00,
0X07,0XFF,0XC0,0X7F,0XE0,0X7F,0XC0,0X00,0X07,0XFF,0XE0,0X3F,0XE0,0X7F,0XC0,0X00,
0X0F,0XFF,0XF0,0X1F,0XC0,0XFF,0X80,0X00,0X0F,0XFF,0XF8,0X0F,0XC0,0XFF,0X80,0X00,
0X1F,0XFF,0XFC,0X0F,0X81,0XFF,0X00,0X00,0X1F,0XFF,0XFE,0X0F,0X81,0XFF,0X00,0X00,
0X3F,0XFF,0XFE,0X0F,0X03,0XFE,0X00,0X00,0X3F,0XFF,0XFE,0X0F,0X03,0XFE,0X00,0X00,
0X7F,0XFF,0XFC,0X0E,0X07,0XFC,0X00,0X00,0X00,0X00,0X00,0X1E,0X07,0XFC,0X00,0X00,
0X00,0X00,0X00,0X1C,0X0F,0XF8,0X00,0X00,0X00,0X00,0X00,0X3C,0X0F,0XF8,0X00,0X00,
0X00,0X00,0X00,0X78,0X1F,0XF0,0X00,0X00,0XFF,0XFF,0XFF,0XFF,0XFF,0XF0,0X00,0X00,
};*/
/*
               *********************************************
               ******************************************** 
              ********************************************* 
              ********************************************  
             ****                                           
             ***                                            
            ***                                             
            **                                              
           **       *********************      *********    
           **      **********************      *********    
          ***      *********************      *********     
          ***      *********************      *********     
         *****      *******************      *********      
         *****       ******************      *********      
        *******       ****************      *********       
        ********       ***************      *********       
       **********       *************      *********        
       ***********       ************      *********        
      *************       **********      *********         
      **************       *********      *********         
     ****************       *******      *********          
     *****************       ******      *********          
    *******************      *****      *********           
    ********************     *****      *********           
   *********************     ****      *********            
   *********************     ****      *********            
  *********************      ***      *********             
                            ****      *********             
                            ***      *********              
                           ****      *********              
                          ****      *********               
 ******************************************** 
*/


void LCD_setWindowArea(uint16_t StartX, uint16_t StartY, uint16_t Width, uint16_t Height)
{
	int8_t s_h,s_l, e_h, e_l;

	  if(DeviceIdCode == 0x9325)
    	 {
    	 	LCD_WriteReg(0x0050,StartY);        //Specify the start/end positions of the window address in the horizontal direction by an address unit
		LCD_WriteReg(0x0051,StartY + Height -1);        //Specify the start positions of the window address in the vertical direction by an address unit 
		LCD_WriteReg(0x0052,320 - StartX - Width); 
		LCD_WriteReg(0x0053,320 - StartX - 1 );        //Specify the end positions of the window address in the vertical direction by an address unit
	 }
	 else
	 {
	 	s_h = (StartX >> 8) & 0Xff;
		s_l = StartX & 0Xff;
		e_h = ((StartX + Width - 1) >> 8) & 0Xff;
		e_l = (StartX + Width - 1) & 0Xff;
		
		LCD_WR_REG(0x2A);
	                        LCD_WR_DATA(s_h);
	                        LCD_WR_DATA(s_l);
	                       // LCD_WR_DATA(0x00);
	                       // LCD_WR_DATA(0xEF);
	                        LCD_WR_DATA(e_h);
	                        LCD_WR_DATA(e_l);

