makerbase-mks/MKS-TFT28-32-Firmware/Utilities/STM32_EVAL/STM3210C_EVAL/stm3210c_lcd_9341.c
		s_h = (StartY >> 8) & 0Xff;
		s_l = StartY & 0Xff;
		e_h = ((StartY + Height - 1) >> 8) & 0Xff;
		e_l = (StartY + Height - 1) & 0Xff;
		
	        LCD_WR_REG(0x2B);
	                        LCD_WR_DATA(s_h);
	                        LCD_WR_DATA(s_l);
	                      //  LCD_WR_DATA(0x01);
	                        LCD_WR_DATA(e_h);
	                        LCD_WR_DATA(e_l);
	 }
    
	

/*	 
*/
}

/**-------------------------------------------------------
  * @函数名 LCD_DrawMonoBinaryPic
  * @功能   在指定座标范围显示一幅已知长宽的二值图片
  * @参数   StartX     行起始座标
  *         StartY     列起始座标
  *         Width      图片宽度
  *         Height     图片高度
  *         BmpAddress 图片数据区域头指针(不含文件信息)
  * @返回值 无
  * 作者    www.armjishu.com
***------------------------------------------------------*/
void LCD_DrawMonoBinaryPic(uint16_t StartX, uint16_t StartY, uint16_t Width, uint16_t Height, const uint8_t *BmpDataAddress)
{
    uint32_t i, j;
    uint16_t line;
    uint8_t  Mask, Temp = 0x00;

    //LCD_DEBUG_PRINTF("\n\r LCD_DrawMonoPic Start X %d Y %d Width %d Height %d"
    //                            , StartX, StartY, Width, Height);

    line=StartX;
    for (i=0;i<Height;i++)
    {
        LCD_SetCursor(line, StartY);
        LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
        Mask = 0x80;
        Temp = *BmpDataAddress;
        BmpDataAddress++;
        //printf("\r\n ");
        for (j=0;j<Width;j++)
        {
            if (Mask == 0)
            {
                /*Read next byte of bit map image and initiate mask*/
                Temp = *BmpDataAddress;
                BmpDataAddress++;
                Mask = 0x80;
             }
            /*Mask actual byte of cursor bitmap image*/
            if (Temp & Mask)
            {
                 LCD_WriteRAM(TextColor); //putchar('*');
            }
            else
            {
                 LCD_WriteRAM(BackColor); //putchar(' ');           
            }
            /*Shift a mask right*/
            Mask >>= 1;
        }
        line++;
    }
}


/**-------------------------------------------------------
  * @函数名 LCD_Image2LcdDrawMonoBinaryPic
  * @功能   在指定座标范围显示一幅Image2Lcd转换的二值图片
  * @参数   StartX     行起始座标
  *         StartY     列起始座标
  *         BmpAddress 图片文件头的地址指针(含有文件信息)
  * @返回值 无
  * 作者    www.armjishu.com
***------------------------------------------------------*/
void LCD_Image2LcdDrawMonoBinaryPic(uint16_t StartX, uint16_t StartY, const uint8_t *BmpAddress)
{
    HEADGRAY * BmpHeadr;
    uint16_t Width, Height;
    uint8_t *BmpData;

    BmpHeadr = (HEADGRAY *)BmpAddress;
    Width  = BmpHeadr->w;
    Height = BmpHeadr->h;
    BmpData = (uint8_t *)(BmpAddress + sizeof(HEADGRAY));

    LCD_DrawMonoBinaryPic(StartX, StartY, Width, Height, (const uint8_t *)BmpData);
}


/**-------------------------------------------------------
  * @函数名 LCD_DrawBmp565Pic
  * @功能   在指定座标范围显示一幅Image2Lcd转换的RGB565图片
  * @参数   StartX     行起始座标
  *         StartY     列起始座标
  *         Width      图片宽度
  *         Height     图片高度
  *         BmpAddress 图片数据区域头指针(不含文件信息)
  * @返回值 无
  * 作者    www.armjishu.com
***------------------------------------------------------*/
void LCD_DrawBmp565Pic(uint16_t StartX, uint16_t StartY, uint16_t Width, uint16_t Height, const uint16_t *BmpAddress)
{
    uint32_t total;
    uint32_t i, j;
    uint32_t pointor;
    uint16_t line;

    //LCD_DEBUG_PRINTF("LCD_DrawBmp565Picture StartX %d StartY %d Width %d Height %d \n\r"
    //                              , StartX, StartY, Width, Height);

    line=StartX;
#if 0  // 这种方法绘制速度快，但是寄存器因为LCD驱动芯片的不同而不同
    total = Width * Height;

    LCD_WriteReg(0x0044,0xEF00 + StartX);        //Specify the start/end positions of the window address in the horizontal direction by an address unit
    LCD_WriteReg(0x0045,StartY);        //Specify the start positions of the window address in the vertical direction by an address unit 
    LCD_WriteReg(0x0046,StartY + Width -1 );        //Specify the end positions of the window address in the vertical direction by an address unit 

    LCD_SetCursor(line, StartY);
  	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

    for (i=0;i<total;i++)
    {
        LCD_WriteRAM(BmpAddress[i]);
    }

    LCD_WriteReg(0x0044,0xEF00);        //Specify the start/end positions of the window address in the horizontal direction by an address unit
    LCD_WriteReg(0x0045,0x0000);        //Specify the start positions of the window address in the vertical direction by an address unit 
    LCD_WriteReg(0x0046,0x013F);        //Specify the end positions of the window address in the vertical direction by an address unit 
#else
    pointor = 0;
    for (i=0;i<Height;i++)
    {
        LCD_SetCursor(line, StartY);
        LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
        for (j=0;j<Width;j++)
        {
            LCD_WriteRAM(BmpAddress[pointor]);
            pointor++;
        }
        line++;
    }
#endif
}


/**-------------------------------------------------------
  * @函数名 LCD_Image2LcdDrawBmp565Pic
  * @功能   在指定座标范围显示一幅Image2Lcd转换的Bmp565图片
  * @参数   StartX     行起始座标
  *         StartY     列起始座标
  *         BmpAddress 图片文件头的地址指针(含有文件信息)
  * @返回值 无
  * 作者    www.armjishu.com
***------------------------------------------------------*/
void LCD_Image2LcdDrawBmp565Pic(uint16_t StartX, uint16_t StartY, const uint8_t *BmpAddress)
{
    HEADCOLOR * BmpHeadr;

    uint16_t Width, Height;
    uint8_t *BmpData;

    BmpHeadr = (HEADCOLOR *)BmpAddress;
    Width  = BmpHeadr->w;
    Height = BmpHeadr->h;
    BmpData = (uint8_t *)(BmpAddress + sizeof(HEADCOLOR));
    if((BmpHeadr->is565 == 1) && (BmpHeadr->gray == 16))
    {
        LCD_DrawBmp565Pic(StartX, StartY, Width, Height, (const uint16_t *)BmpData);
    }
    else
    {
        //LCD_DEBUG_PRINTF("\n\r LCD_Image2LcdDrawBmp565Pic: Not Image2Lcd or Bmp565 format.");
    }
}



/*  字符串"★欢迎您使用神舟系列开发板"的字库  */ 
/*const uint8_t WelcomeStr[13][72]={
    //★欢迎您使用神舟系列开发板
    //No:0	★   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x10,0x00,0x00,0x18,0x00,0x00,0x18,0x00,0x00,
    0x18,0x00,0x00,0x3C,0x00,0x00,0x3C,0x00,0x00,0x7C,0x00,0x3F,0xFF,0xFC,0x1F,0xFF,0xF8,0x07,0xFF,
    0xE0,0x03,0xFF,0xC0,0x01,0xFF,0x80,0x01,0xFF,0x80,0x01,0xFF,0x80,0x01,0xFF,0x80,0x03,0xE7,0xC0,
    0x03,0x81,0xC0,0x03,0x00,0xC0,0x04,0x00,0x60,0x00,0x00,0x00,0x00,0x00,0x00},
    //No:1	欢   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x02,0x00,0x00,0x06,0x00,0x00,0x46,0x00,0x3F,0xC4,0x00,0x00,
    0xC4,0x04,0x00,0x8F,0xFE,0x20,0x88,0x08,0x11,0x89,0x90,0x09,0x11,0x80,0x05,0x21,0x80,0x02,0x21,
    0x80,0x03,0x03,0x80,0x05,0x82,0x80,0x05,0x82,0x40,0x08,0xC2,0x40,0x08,0xC4,0x60,0x10,0x4C,0x20,
    0x20,0x08,0x30,0x40,0x10,0x18,0x00,0x60,0x0E,0x00,0x80,0x00,0x00,0x00,0x00},
    //No:2	迎   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x02,0x00,0x0C,0x0E,0x00,0x06,0x72,0x08,0x04,0x41,0xFC,0x00,
    0x41,0x08,0x00,0x41,0x08,0x04,0x41,0x08,0x7E,0x41,0x08,0x04,0x41,0x08,0x04,0x41,0x08,0x04,0x41,
    0x08,0x04,0x45,0x08,0x04,0x59,0x08,0x04,0x61,0x78,0x04,0x41,0x18,0x04,0x01,0x00,0x1A,0x01,0x00,
    0x71,0x00,0x00,0x60,0xE0,0x02,0x00,0x3F,0xFC,0x00,0x00,0x00,0x00,0x00,0x00},
    //No:3	您   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x03,0x18,0x00,0x06,0x18,0x00,0x04,0x30,0x00,0x0C,0x3F,0xFC,0x0C,
    0x44,0x10,0x14,0x43,0x20,0x24,0x82,0x00,0x44,0x32,0x40,0x04,0x22,0x20,0x04,0x42,0x18,0x04,0x82,
    0x18,0x05,0x1E,0x08,0x04,0x06,0x00,0x00,0x20,0x00,0x01,0x98,0x20,0x09,0x8C,0x10,0x09,0x88,0x4C,
    0x19,0x80,0x4C,0x31,0x80,0x44,0x01,0x80,0xE0,0x00,0xFF,0xC0,0x00,0x00,0x00},
    //No:4	使   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x81,0x00,0x03,0x01,0x00,0x03,0x01,0x04,0x02,0xFF,0xFE,0x06,
    0x01,0x00,0x04,0x01,0x00,0x0E,0x21,0x18,0x0E,0x3F,0xE8,0x16,0x21,0x08,0x26,0x21,0x08,0x26,0x21,
    0x08,0x46,0x3F,0xF8,0x06,0x21,0x00,0x06,0x13,0x00,0x06,0x12,0x00,0x06,0x0A,0x00,0x06,0x06,0x00,
    0x06,0x06,0x00,0x06,0x0F,0x00,0x06,0x10,0xE0,0x06,0x60,0x3C,0x01,0x80,0x00},
    //No:5	用   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x08,0x00,0x10,0x0F,0xFF,0xF8,0x0C,0x08,0x10,0x0C,0x08,0x10,0x0C,
    0x08,0x10,0x0C,0x08,0x10,0x0C,0x08,0x10,0x0F,0xFF,0xF0,0x08,0x08,0x10,0x08,0x08,0x10,0x08,0x08,
    0x10,0x08,0x08,0x10,0x0F,0xFF,0xF0,0x08,0x08,0x10,0x08,0x08,0x10,0x08,0x08,0x10,0x10,0x18,0x10,
    0x10,0x18,0x10,0x20,0x18,0x10,0x20,0x18,0xF0,0x40,0x00,0x30,0x00,0x00,0x00},
    //No:6	神   使用频度=1
    {	0x00,0x00,0x00,0x00,0x01,0x00,0x04,0x00,0x80,0x02,0x00,0x80,0x02,0x00,0x80,0x00,0x00,0x88,0x00,
    0x9F,0xFC,0x3F,0x90,0x88,0x01,0x10,0x88,0x03,0x10,0x88,0x02,0x1F,0xF8,0x06,0x10,0x88,0x0D,0x90,
    0x88,0x0C,0xD0,0x88,0x14,0x50,0x8C,0x24,0x1F,0xFC,0x44,0x10,0x88,0x04,0x00,0x80,0x04,0x00,0x80,
    0x04,0x00,0x80,0x04,0x00,0x80,0x04,0x00,0x80,0x04,0x01,0x80,0x00,0x01,0x00},
    //No:7	舟   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x00,0x00,0x10,0x00,0x00,0x20,0x00,0x03,0xFF,0xE0,0x02,
    0x00,0x40,0x02,0x20,0x40,0x02,0x10,0x40,0x02,0x18,0x40,0x02,0x08,0x40,0x02,0x00,0x40,0x02,0x00,
    0x4E,0x3F,0xFF,0xF0,0x02,0x00,0x40,0x02,0x20,0x40,0x02,0x10,0x40,0x06,0x18,0x40,0x06,0x18,0x40,
    0x04,0x00,0x40,0x08,0x00,0x40,0x10,0x07,0xC0,0x20,0x01,0x80,0x40,0x00,0x00},
    //No:8	系   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0xF8,0x00,0x7F,0x00,0x1F,0x98,0x00,0x00,0x30,0x00,0x00,
    0x40,0x40,0x00,0x80,0xC0,0x07,0x3F,0x00,0x07,0xC4,0x00,0x00,0x18,0x00,0x00,0x60,0x40,0x00,0x80,
    0x20,0x07,0x7F,0xF8,0x07,0x88,0x18,0x01,0x08,0x00,0x00,0xC8,0x80,0x01,0x88,0x60,0x02,0x08,0x38,
    0x04,0x08,0x1C,0x18,0x08,0x0C,0x20,0xF8,0x0C,0x00,0x18,0x00,0x00,0x00,0x00},
    //No:9	列   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x0C,0x00,0x0C,0x08,0x3F,0xF0,0x08,0x01,0x00,0x08,0x03,
    0x01,0x88,0x02,0x00,0x88,0x02,0x18,0x88,0x07,0xF8,0x88,0x04,0x10,0x88,0x0C,0x30,0x88,0x0A,0x20,
    0x88,0x13,0x20,0x88,0x21,0x60,0x88,0x01,0x40,0x88,0x00,0xC0,0x88,0x00,0x81,0x88,0x01,0x01,0x08,
    0x02,0x00,0x08,0x04,0x00,0x08,0x18,0x00,0x78,0x20,0x00,0x18,0x00,0x00,0x00},
    //No:10	开   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x18,0x1F,0xFF,0xE0,0x00,0x81,0x80,0x00,
    0x81,0x80,0x00,0x81,0x80,0x00,0x81,0x80,0x00,0x81,0x80,0x00,0x81,0x84,0x00,0x81,0x8C,0x1F,0xFF,
    0xF0,0x00,0x81,0x80,0x00,0x81,0x80,0x00,0x81,0x80,0x01,0x81,0x80,0x01,0x01,0x80,0x01,0x01,0x80,
    0x02,0x01,0x80,0x04,0x01,0x80,0x08,0x01,0x80,0x30,0x01,0x80,0x00,0x00,0x00},
    //No:11	发   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x31,0x00,0x04,0x60,0xC0,0x0C,0x60,0x60,0x0C,0x60,0x60,0x08,
    0x40,0x00,0x18,0x40,0x0C,0x17,0xFF,0xF0,0x00,0xC0,0x00,0x00,0xC0,0x00,0x00,0xFF,0xE0,0x00,0xA0,
    0x60,0x01,0xA0,0x40,0x01,0x10,0x80,0x03,0x09,0x80,0x02,0x09,0x00,0x06,0x06,0x00,0x04,0x06,0x00,
    0x08,0x0D,0x80,0x10,0x30,0xE0,0x20,0x40,0x3E,0x43,0x80,0x08,0x00,0x00,0x00},
    //No:12	板   使用频度=1
    {	0x00,0x00,0x00,0x00,0x00,0x00,0x06,0x00,0x30,0x04,0x00,0xF8,0x04,0x1F,0x00,0x04,0x10,0x00,0x04,
    0x90,0x00,0x3F,0x10,0x00,0x0C,0x10,0x10,0x0C,0x1F,0xF0,0x0E,0x14,0x30,0x0D,0x14,0x20,0x1C,0x94,
    0x20,0x14,0xB2,0x60,0x14,0x32,0x40,0x24,0x23,0xC0,0x44,0x21,0x80,0x44,0x21,0x80,0x04,0x23,0xC0,
    0x04,0x46,0x60,0x04,0x88,0x38,0x04,0xB0,0x1C,0x05,0xC0,0x00,0x00,0x00,0x00},
};*/


/**-------------------------------------------------------
  * @函数名 LCD_DrawChinaChar
  * @功能   在指定座标显示中文字符
  * @参数   StartX     行起始座标
  *         StartY     列起始座标
  *         cpFontArray 字库数组的地址指针
  * @返回值 无
  * 作者    www.armjishu.com
***------------------------------------------------------*/
void LCD_DrawChinaChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *cpFontArray)
{
    uint32_t index = 0, i = 0, j = 0;
    uint8_t Xaddress = 0;

    Xaddress = Xpos;

    LCD_SetCursor(Xaddress, Ypos);

