makerbase-mks/MKS-TFT28-32-Firmware/Utilities/STM32_EVAL/STM3210C_EVAL/stm3210c_lcd_9341.c
    sprintf((char *)sStr, "SIZE:%dX%d", LCD_Currentfonts->Width, LCD_Currentfonts->Height);

    LCD_Clear(LCD_COLOR_WHITE);
    LCD_DisplayStringLine(0, sStr);
    line = LCD_Currentfonts->Height + 1;
    for(cChar = 0x20; cChar<=0x7F; cChar++)
    {
        LCD_DisplayChar(line, refcolumn, cChar);

        refcolumn += LCD_Currentfonts->Width;
        refcolumn++;

        if(refcolumn + LCD_Currentfonts->Width > LCD_PIXEL_WIDTH)
        {
            line += LCD_Currentfonts->Height;
            line++;
            refcolumn = 0;
            if((line+LCD_Currentfonts->Height) > LCD_PIXEL_HEIGHT)
            {
                line = LCD_Currentfonts->Height + 1;
                if(cChar<=0x7F)
                {
                    Delay(36000000);
                    LCD_Clear(LCD_COLOR_WHITE);
                    LCD_DisplayStringLine(0, sStr);
                }
            }
        }
    }
}

/**-------------------------------------------------------
  * @函数名 LCD_DisplayAllFont
  * @功能   通过修改系统当前使用的ASCII字库类型，
  *         依次展示所有支持的字库
  * @参数   无
  * @返回值 无
  * 作者    www.armjishu.com
***------------------------------------------------------*/
/*void LCD_DisplayAllFont(void)
{
    uint32_t i;
    sFONT *LCD_OldCurrentfonts;

    LCD_OldCurrentfonts = LCD_GetFont();

    for(i= 0; pFontTable[i] != 0; i++)
    {
        LCD_SetFont(pFontTable[i]);
        LCD_DisplayCurrentFont();
        Delay(36000000);
    }

    LCD_SetFont(LCD_OldCurrentfonts);
}*/

 
/*******************  (C) COPYRIGHT 2013 www.armjishu.com  *****END OF FILE****/

